[
  {
    "name": "LuxSUV",
    "client": "LUX SUV Transportation",
    "image": "/images/projects/luxsuv.webp",
    "description": "A web-based luxury ride services app providing premium transportation solutions for high-end clients. Features on-demand booking, real-time tracking, and secure payment integration.",
    "responsibilities": [
      "Designed and developed the front-end interface using Vanilla JS and Bootstrap.",
      "Integrated RESTful APIs for booking and payment processing.",
      "Implemented geolocation for routing and tracking.",
      "Developed a responsive UI to support mobile and desktop users.",
      "Integrated secure payment gateways using Stripe for seamless transactions.",
      "Performed unit and integration testing to ensure reliability.",
      "Optimized performance for real-time tracking updates using WebSockets."
    ],
    "technologies": ["Javascript", "Bootstrap", "REST API", "Geolocation API", "Stripe"],
    "link": "https://luxsuv.us/",
    "status": "In-Progress",
    "personal": true,
    "outcome": "Successfully launched the initial version of the app, achieving a 30% increase in booking conversions within the first three months."
  },
  {
    "name": "Companion App Test Automation",
    "client": "Wizards of the Coast",
    "image": "/images/projects/companion-app-test-automation.webp",
    "description": "Automated testing for the Magic: The Gathering Companion App, enhancing gameplay support.",
    "responsibilities": [
      "Integrated automated tests into CI pipelines (GitLab).",
      "Built automation for Android, iOS, and hybrid mobile apps.",
      "Used Sauce Labs and AWS Device Farm for multi-device testing.",
      "Developed BDD framework using Cucumber with TDD methodology.",
      "Created scalable test environments with AWS and Mac Stadium.",
      "Participated in Agile ceremonies and drove QA improvements.",
      "Led offshore and onsite teams in testing and documentation efforts.",
      "Provided support for regression, demos, and release readiness.",
      "Maintained automation suite and collaborated with cross-functional teams.",
      "Communicated daily status updates and managed test risks."
    ],
    "technologies": ["Kotlin", "Java", "Cucumber", "Appium", "JUnit", "GitLab", "Swift", "AWS Device Farm", "XCUITest", "SauceLabs", "Mac Stadium"],
    "link": [
      "https://magic.wizards.com/en/products/companion-app/ios",
      "https://magic.wizards.com/en/products/companion-app/android"
    ],
    "status": "Completed",
    "personal": false,
    "outcome": "Achieved 95% test automation coverage, reduced regression testing time by 60%, and supported seamless event management for thousands of players."
  },
  {
    "name": "Health Connect Automation",
    "client": "Providence Health Services",
    "image": "/images/projects/health-connect-automation.webp",
    "description": "Developed automation for a patient-facing healthcare app to streamline medical services.",
    "responsibilities": [
      "Developed automation framework for Android, iOS, and Web using Java/JUnit.",
      "Built test plans and matrices for automation strategy.",
      "Integrated Bitrise CI for Android deployment testing.",
      "Automated deep linking and parallel app testing.",
      "Participated in Agile ceremonies and feature grooming.",
      "Contributed to Bug Bash sessions for quality analysis.",
      "Conducted demos highlighting automation impact.",
      "Collaborated with teams to ensure requirement alignment."
    ],
    "technologies": ["Java", "JUnit", "JavaScript", "Appium", "Selenium", "Bitrise", "Android Studio", "Xcode"],
    "link": [
      "https://www.providence.org/apps/ios",
      "https://www.providence.org/apps/android"
    ],
    "status": "Completed",
    "personal": false,
    "outcome": "Automated 80% of functional tests, improved release cycle efficiency by 25%, and enhanced user experience for patient-facing features."
  },
  {
    "name": "ADP Migration Testing",
    "client": "Sempra Energy",
    "image": "/images/projects/adp-migration-testing.webp",
    "description": "Automated testing for HR and payroll system migration to ADP's cloud platform.",
    "responsibilities": [
      "Created test plans and test strategy documents.",
      "Automated tests using WebDriver and Cucumber.",
      "Triggered test builds via Jenkins/Bamboo.",
      "Ran automation on multiple browsers/devices via Sauce Labs.",
      "Participated in Agile ceremonies and sprint grooming.",
      "Reviewed framework code for optimization."
    ],
    "technologies": ["Java", "Selenium WebDriver", "Cucumber", "Jenkins", "Bamboo", "SauceLabs"],
    "link": [],
    "status": "Completed",
    "personal": false,
    "outcome": "Ensured 100% data integrity during migration, reduced manual testing effort by 40%, and supported a smooth transition for 5,000+ employees."
  },
  {
    "name": "PMS Mobile App Testing",
    "client": "Hilton",
    "image": "/images/projects/pms-mobile-app-testing.webp",
    "description": "Built automation for a staff-facing app to manage hotel operations and guest services.",
    "responsibilities": [
      "Designed and executed functional requirement walkthroughs.",
      "Developed test strategy and test matrix from business specs.",
      "Built automation framework using Cucumber and Appium.",
      "Managed test builds with Jenkins/Bamboo.",
      "Mentored new QA hires and led daily team syncs.",
      "Communicated with offshore teams and stakeholders."
    ],
    "technologies": ["Java", "Cucumber", "Appium", "Jenkins", "Bamboo", "Android Studio"],
    "link": [],
    "status": "Completed",
    "personal": false,
    "outcome": "Automated 70% of staff workflows, improved check-in process efficiency by 20%, and enhanced staff productivity across multiple hotels."
  },
  {
    "name": "Japan Migration & UK Chip and Pin",
    "client": "American Express",
    "image": "/images/projects/japan-migration-uk-chip-and-pin.webp",
    "description": "Automated testing for system modernization and EMV-compliant card processing.",
    "responsibilities": [
      "Built Selenium test automation suite in CI (Jenkins).",
      "Participated in backlog grooming and sprint planning.",
      "Created and maintained test metrics and reporting.",
      "Worked with offshore team for development/testing alignment.",
      "Presented users in daily SCRUM/demo meetings.",
      "Assisted in test case design and execution in Rally."
    ],
    "technologies": ["Java", "Selenium", "Spring Framework", "Jenkins", "Rally"],
    "link": [],
    "status": "Completed",
    "personal": false,
    "outcome": "Achieved 90% test automation for critical workflows, ensured compliance with regional standards, and supported successful launches in Japan and UK markets."
  }
]